{
    "questions": [
        {
            "id": 1,
            "statement": "Como você se sente ao participar de atividades em grupo?",
            "alternatives": [
                {"id":"a", "text":"Prefiro observar e colaborar de forma discreta."},
                {"id":"b", "text":"Gosto de conversar e me divertir durante as atividades."},
                {"id":"c", "text":"Me sinto motivado a liderar ou tomar decisões."},
                {"id":"d", "text":"Fico mais confortável com tarefas individuais."}
            ]
        },
        {
            "id": 2,
            "statement": "Quando precisa começar uma nova tarefa, você:",
            "alternatives": [
                {"id":"a", "text":"Espera instruções claras e começa com calma."},
                {"id":"b", "text":"Começa com entusiasmo, mesmo sem ter todos os detalhes."},
                {"id":"c", "text":"Toma a frente e inicia o trabalho imediatamente."},
                {"id":"d", "text":"Analisa bem antes de dar o primeiro passo."}
            ]
        },
        {
            "id": 3,
            "statement": "Quando você entra em uma nova turma na faculdade, sua reação mais comum é:",
            "alternatives": [
                {"id":"a", "text":"Já puxo papo com alguém, adoro conhecer gente nova!"},
                {"id":"b", "text":"Observo quem pode ser útil em trabalhos e começo a me aproximar estrategicamente."},
                {"id":"c", "text":"Fico mais na minha, levo um tempo para me sentir à vontade."},
                {"id":"d", "text":"Espero que o ambiente se acalme e só interajo se for necessário. "}
            ]
        },
        {
            "id": 4,
            "statement": "Você está sobrecarregado com prazos e provas. Sua reação:",
            "alternatives": [
                {"id":"a", "text":"Tenta relaxar vendo algo ou saindo com amigos, mesmo sabendo que deveria estudar."},
                {"id":"b", "text":"Organiza sua agenda e encara tudo com intensidade. Nada vai te parar."},
                {"id":"c", "text":"Sente o peso das cobranças e fica ansioso com medo de não dar conta."},
                {"id":"d", "text":"Faz o possível, mas sem desespero. Acha que tudo se resolve com paciência."}
            ]
        },
        {
            "id": 5,
            "statement": "Quando há uma discussão no grupo de estudos, você tende a:",
            "alternatives": [
                {"id":"a", "text":"Intervém tentando descontrair e mudar o assunto."},
                {"id":"b", "text":"Toma uma posição firme e tenta resolver de forma direta."},
                {"id":"c", "text":"Fica desconfortável e evita se envolver, mas pensa muito sobre aquilo depois.."},
                {"id":"d", "text":"Escuta todos os lados e sugere um meio-termo para acalmar a situação."}
            ]
        },
        {
            "id": 6,
            "statement": "Em uma apresentação de trabalho, você:",
            "alternatives": [
                {"id":"a", "text":"Gosta de falar, se expressa com entusiasmo e até faz piadas."},
                {"id":"b", "text":"Usa a oportunidade para se destacar e impressionar."},
                {"id":"c", "text":"Fica nervoso e ensaia bastante para se sentir seguro."},
                {"id":"d", "text":"Prefere falar por último ou deixar que outros apresentem."}
            ]
        },
        {
            "id": 7,
            "statement": "Quando o professor é rude ao corrigir sua dúvida ou trabalho, você:",
            "alternatives": [
                {"id":"a", "text":"Fica indignado, comenta com os colegas, mas depois esquece o assunto."},
                {"id":"b", "text":"Responde na hora ou guarda aquilo como motivação para se superar."},
                {"id":"c", "text":"Leva para o lado pessoal e fica remoendo a situação por dias."},
                {"id":"d", "text":"Tenta entender o lado do professor e evita confrontos."}
            ]
        },
        {
            "id": 8,
            "statement": "Quando pensa sobre seu futuro na carreira, você:",
            "alternatives": [
                {"id":"a", "text":"Tem muitas ideias, mas nem sempre foca em uma só."},
                {"id":"b", "text":"Já tem metas claras e faz de tudo para atingi-las."},
                {"id":"c", "text":"Se preocupa com as incertezas e prefere caminhos mais seguros."},
                {"id":"d", "text":"Vai deixando rolar e toma decisões com calma, conforme as coisas se mostram."}
            ]
        },
        {
            "id": 9,
            "statement": "Em relação a mudanças inesperadas no conteúdo ou formato das aulas, você:",
            "alternatives": [
                {"id":"a", "text":"Aceita, mas prefere que não seja com frequência."},
                {"id":"b", "text":"Gosta, pois traz novidade."},
                {"id":"c", "text":"Se adapta rapidamente e assume o controle."},
                {"id":"d", "text":"Fica desconfortável, pois precisa de previsibilidade."}
            ]
        },
        {
            "id": 10,
            "statement": "Quando você está em aula, o que mais chama sua atenção?",
            "alternatives": [
                {"id":"a", "text":"A organização e a clareza do conteúdo."},
                {"id":"b", "text":"A dinâmica e o envolvimento com os colegas."},
                {"id":"c", "text":"Os desafios e a chance de se destacar."},
                {"id":"d", "text":"Os detalhes e a profundidade dos temas abordados."}
            ]
        },
        {
            "id": 11,
            "statement": "Quando um colega erra durante uma apresentação, você normalmente:",
            "alternatives": [
                {"id":"a", "text":"Pensa em como pode ajudar sem chamar atenção."},
                {"id":"b", "text":"Ri, mas depois tenta animá-lo."},
                {"id":"c", "text":"Corrige ou orienta na hora se puder. "},
                {"id":"d", "text":"Fica nervoso só de pensar que poderia ser você."}
            ]
        },
        {
            "id": 12,
            "statement": "Quando está em um projeto longo, você:",
            "alternatives": [
                {"id":"a", "text":"Prefere manter o ritmo constante até o final."},
                {"id":"b", "text":"Se motiva com novidades no meio do caminho."},
                {"id":"c", "text":"Fica focado em alcançar os resultados."},
                {"id":"d", "text":"Revisa tudo com cuidado para garantir perfeição."}
            ]
        },
        {
            "id": 13,
            "statement": "Em um evento ou aula mais movimentada, você:",
            "alternatives": [
                {"id":"a", "text":"Observa, participa discretamente."},
                {"id":"b", "text":"Interage, conversa e se diverte."},
                {"id":"c", "text":"Lidera ou organiza a atividade."},
                {"id":"d", "text":"Se sente sobrecarregado e prefere ambientes calmos."}
            ]
        },
        {
            "id": 14,
            "statement": "Como você se sente em atividades com prazos curtos e pressão?",
            "alternatives": [
                {"id":"a", "text":"Trabalha bem, desde que tudo esteja organizado."},
                {"id":"b", "text":"Se atrapalha um pouco, mas dá um jeito."},
                {"id":"c", "text":"Se motiva com o desafio e entrega rápido."},
                {"id":"d", "text":"Fica estressado e teme não conseguir fazer perfeito."}
            ]
        },
        {
            "id": 15,
            "statement": "Um professor tem uma didática confusa e as aulas não fazem sentido. Você:",
            "alternatives": [
                {"id":"a", "text":"Reclama com os colegas e até ri da situação, tentando levar na esportiva."},
                {"id":"b", "text":"Vai direto falar com o professor ou coordenação para exigir uma solução."},
                {"id":"c", "text":"Fica frustrado e tenta aprender tudo sozinho, mesmo que isso te desgaste."},
                {"id":"d", "text":"Tolera a situação com paciência e evita conflitos, mesmo achando injusto."}
            ]
        },
        {
            "id": 16,
            "statement": "Quando você estuda por conta porque não entendeu nada da aula, você:",
            "alternatives": [
                {"id":"a", "text":"Procura um colega para estudar junto ou assistir um vídeo no YouTube, mas se distrai fácil."},
                {"id":"b", "text":"Cria seu próprio cronograma e vai atrás de outros materiais para dominar o conteúdo."},
                {"id":"c", "text":"Sente que nunca está suficientemente preparado e fica inseguro para a prova."},
                {"id":"d", "text":"Estuda no seu ritmo, com tranquilidade, mesmo que o aprendizado leve mais tempo."}
            ]
        },
        {
            "id": 17,
            "statement": "Como você se sente ao ser chamado para responder uma pergunta na frente da turma?",
            "alternatives": [
                {"id":"a", "text":"Fico nervoso e penso muito no que vou dizer."},
                {"id":"b", "text":"Fico animado e respondo com naturalidade."},
                {"id":"c", "text":"Respondo com firmeza e gosto de mostrar que sei."},
                {"id":"d", "text":"Respondo com calma, mesmo que não saiba tudo."}
            ]
        },
        {
            "id": 18,
            "statement": "Ao receber uma nota abaixo da esperada, sua reação mais comum é:",
            "alternatives": [
                {"id":"a", "text":"Fico frustrado e reflito onde errei."},
                {"id":"b", "text":"Levo na esportiva e digo que vou melhorar da próxima."},
                {"id":"c", "text":"Me irrito, mas uso isso como motivação para superar."},
                {"id":"d", "text":"Aceito com tranquilidade e sigo em frente."}
            ]
        },
        {
            "id": 19,
            "statement": "Quando o semestre começa, você costuma:",
            "alternatives": [
                {"id":"a", "text":"Criar um plano de estudos detalhado desde o início."},
                {"id":"b", "text":"Se animar com as aulas e os colegas."},
                {"id":"c", "text":"Ficar motivado a se destacar em tudo."},
                {"id":"d", "text":"Seguir o ritmo das aulas com calma e consistência."}
            ]
        },
        {
            "id": 20,
            "statement": "Durante aulas longas, você geralmente:",
            "alternatives": [
                {"id":"a", "text":"Se distrai com facilidade, mas tenta manter a atenção."},
                {"id":"b", "text":"Se concentra bem e mantém o foco até o fim."},
                {"id":"c", "text":"Sente cansaço mental, mesmo prestando atenção."},
                {"id":"d", "text":"Mantém-se calmo e acompanha o conteúdo no seu tempo."}
            ]
        }
    ]
}